const DIRECTIONS = [
  {
    "key": "NSH",
    "label": "Нийгэм-сэтгэл хөдлөл"
  },
  {
    "key": "HEM",
    "label": "Хөдөлгөөн, эрүүл мэнд"
  },
  {
    "key": "HEL",
    "label": "Хэл яриа"
  },
  {
    "key": "BNO",
    "label": "Байгаль, нийгмийн орчин"
  },
  {
    "key": "MAT",
    "label": "Математик"
  },
  {
    "key": "ZUR",
    "label": "Зураг, урлал"
  },
  {
    "key": "HUG",
    "label": "Хөгжим"
  }
];

const SUD_DATA = {
  "NSH": {
    "1": [
      {
        "code": "НСХ1.1а",
        "text": "Биеийн зарим мэдрэмжээ нүүр, гар, биеийн хөдөлгөөн, дуу авиа, үгээр илэрхийлдэг болно."
      },
      {
        "code": "НСХ1.1б",
        "text": "Өөрийн хэрэгцээг нүүр, гар, биеийн хөдөлгөөн, дуу авиа, үгээр илэрхийлдэг болно."
      },
      {
        "code": "НСХ1.1в",
        "text": "Уурлаж тавгүйтсэн үедээ насанд хүрэгчээр аргадуулж тайвширдаг болно."
      },
      {
        "code": "НСХ1.2а",
        "text": "Бусдын биеийн зарим мэдрэмжийг ойлгодог болно."
      },
      {
        "code": "НСХ1.2б",
        "text": "Бусдыг энэрсэн сэтгэлээ нүүр гар, биеийн хөдөлгөөн, дуу авиа, үгээр илэрхийлдэг болно."
      },
      {
        "code": "НСХ1.2в",
        "text": "Насанд хүрэгчийн тусламжтай зарим зан үйлүүдийг таньдаг болно."
      },
      {
        "code": "НСХ1.3а",
        "text": "Насанд хүрэгчийн тусламжтайгаар байнга хэрэглэдэг эд юмсыг байранд нь хураадаг болно."
      },
      {
        "code": "НСХ1.3б",
        "text": "Бусад хүмүүс ижил зүйл хийж байгааг ажиглаж мэддэг болно."
      },
      {
        "code": "НСХ1.3в",
        "text": "Насанд хүрэгчийн тусламжтай өдрийн хуваарьт үйл ажиллагаанд дасан зохицож оролцдог болно."
      }
    ],
    "2": [
      {
        "code": "НСХ2.1а",
        "text": "Биеийн мэдрэмж, сэтгэл хөдлөлийг үгээр илэрхийлдэг болно."
      },
      {
        "code": "НСХ2.1б",
        "text": "Өөрийн хэрэгцээгээ илэрхийлдэг болно."
      },
      {
        "code": "НСХ2.1в",
        "text": "Уурлаж тавгүйтсэн шалтгааныг нь асууж ярилцахад тайвширдаг болно."
      },
      {
        "code": "НСХ2.2а",
        "text": "Бусдын биеийн мэдрэмж, сэтгэл хөдлөлийг үгээр нэрлэдэг болно."
      },
      {
        "code": "НСХ2.2б",
        "text": "Насанд хүрэгчийн тусламжтай бусдын биеийн мэдрэмж, сэтгэл хөдлөлийг анзаарч энэрэх үйлдэл үзүүлдэг болно."
      },
      {
        "code": "НСХ2.2в",
        "text": "Насанд хүрэгчийн тусламжтай зан үйлүүдийг тустай,тусгүйгээр ангилдаг болно."
      },
      {
        "code": "НСХ2.3а",
        "text": "Юмс үзэгдлийн хоорондын хамаарлыг таньж ойлгодог болно."
      },
      {
        "code": "НСХ2.3б",
        "text": "Багшийн чиглүүлэгтэйгээр бусадтай харагдах байдлаар ижил төстэй байгааг тодорхойлно."
      },
      {
        "code": "НСХ2.3в",
        "text": "Аливаа үйл ажиллагаанд бие даан дуртай оролцдог болно."
      }
    ],
    "3": [
      {
        "code": "НСХ3.1а",
        "text": "Сэтгэл хөдлөлөө таатай,таагүй байгааг илэрхийлдэг болно."
      },
      {
        "code": "НСХ3.1б",
        "text": "Өөрийн дуртай дургүй,чадах чадахгүй зүйлсээ илэрхийлж хэрэгцээгээ тайлбарладаг болно."
      },
      {
        "code": "НСХ3.1в",
        "text": "Уурлаж тавгүйтсэн үедээ бусадтай ярилцах,\"тайвшрах булан\"-дочих зэргээр тайвширдаг болно."
      },
      {
        "code": "НСХ3.2а",
        "text": "Бусдын сэтгэл хөдлөлийн таатай, таагүй, байгааг тайлбарладаг болно."
      },
      {
        "code": "НСХ3.2б",
        "text": "Бусдын таагүй сэтгэл хөдлөлийн шалтгааныг энгийнээр тайлбарлаж энэрэх үйлдэл үзүүлдэг болно."
      },
      {
        "code": "НСХ3.2в",
        "text": "Зан үйлүүдийг яагаад тустай,тусгүй болохыг тайлбарладаг болно."
      },
      {
        "code": "НСХ3.3а",
        "text": "Өөрийнх нь үйлдэл бусдад хэрхэн нөлөөлдгийг ойлгож тайлбарладаг болно."
      },
      {
        "code": "НСХ3.3б",
        "text": "Бусадтай сэтгэл хөдлөл,сонирхлоороо ижил төстэйгөө мэддэг болно."
      },
      {
        "code": "НСХ3.3в",
        "text": "Үйл ажиллагаанд тодорхой үүрэг хүлээж оролцдог болно."
      }
    ],
    "4": [
      {
        "code": "НСХ4.1а",
        "text": "Сэтгэлийн мэдрэмжээ таатай,таагүй байгааг илэрхийлдэг болно."
      },
      {
        "code": "НСХ4.1б",
        "text": "Өөрийн дуртай дургүй, чадах чадахгүй зүйлсийг тайлбарлаж сонголт хийдэг болно."
      },
      {
        "code": "НСХ4.1в",
        "text": "Тайвшрах аргаас насанд хүрэгчийн тусламжтай хэрэглэдэг болно."
      },
      {
        "code": "НСХ4.2а",
        "text": "Бусдын сэтгэлийн мэдрэмж нь таатай,таагүй байгааг тайлбарладаг болно."
      },
      {
        "code": "НСХ4.2б",
        "text": "Бусдын нөхцөл байдалд тохируулан энэрэх үйлдэл үзүүлдэг болно."
      },
      {
        "code": "НСХ4.2в",
        "text": "Үүссэн зөрчилдөөнийг багшийн чиглүүлэгтэйгээр тустай зан үйлээр шийддэг болно."
      },
      {
        "code": "НСХ4.3а",
        "text": "Хүмүүс хоорондоо хэрхэн харилцан хамааралтай байдгийг тайлбарладаг болно."
      },
      {
        "code": "НСХ4.3б",
        "text": "Өөрөө хүмүүсээс олон талаараа ялгаатай, ижил төстэй байгааг тодорхойлдог болно."
      },
      {
        "code": "НСХ4.3в",
        "text": "Өдөр тутмын үйл ажиллагаанд тодорхой дүрэм баримтлан хамтран оролцдог болно."
      }
    ]
  },
  "HEM": {
    "1": [
      {
        "code": "ХЭМ1.1б",
        "text": "Суугаа байрлалд өлмийг ээтийлгэх, жийх хөдөлгөөнийг гүйцэтгэнэ."
      },
      {
        "code": "ХЭМ1.1в",
        "text": "Дугуй дүрс (20 см диаметр) дээр гараа алдлан тэнцвэр хадгалан зогсоно."
      },
      {
        "code": "ХЭМ1.1г",
        "text": "Байрандаа болон чиглэлээ өөрчилж алхаж, гүйнэ."
      },
      {
        "code": "ХЭМ1.1д",
        "text": "Сэдэвт алхалт,гүйлтийг багшийн зааврын дагуу даган дуурайж гүйцэтгэнэ."
      },
      {
        "code": "ХЭМ1.1е",
        "text": "Дөрвөн хөллөж 20 см-ын зайтай зураасны хооронд мөлхөнө."
      },
      {
        "code": "ХЭМ1.1ж",
        "text": "Хэвтээ байрлалд хажуу тийш (харандаа) 2 удаа дараалан өнхөрнө."
      },
      {
        "code": "ХЭМ1.1з",
        "text": "Байрандаа алхаж эргэнэ."
      },
      {
        "code": "ХЭМ1.1и",
        "text": "Хоёр хөл дээр байрандаа үсэрч бууна."
      },
      {
        "code": "ХЭМ1.1л",
        "text": "Шатны бариулаас барьж 10 гишгүүрт өгсөж,уруудна."
      },
      {
        "code": "ХЭМ1.1м",
        "text": "Бөмбөгийг ойр зайд шидэж дамжуулна, барьж авна."
      },
      {
        "code": "ХЭМ1.1о",
        "text": "Бөмбөгийг 1,5 м зайд өшиглөж өнхрүүлж,дамжуулна."
      },
      {
        "code": "ХЭМ1.2а",
        "text": "Хувийн ариун цэврийг сахих үйлийг насанд хүрэгчийн дэмжлэгтэйгээр хамтран хийнэ."
      },
      {
        "code": "ХЭМ1.2в",
        "text": "Хоол хүнсний бүтээгдэхүүнийг угааж, чанаж болгож иддэгийг мэднэ, ялгана."
      },
      {
        "code": "ХЭМ1.2г",
        "text": "Хоолны хэрэгслийг нэрлэж,зориулалтын дагуу хэрэглэнэ."
      },
      {
        "code": "ХЭМ1.2е",
        "text": "Хүрээлэн буй орчинд байгаа болгоомжлох зүйлсийг мэднэ,ялгана."
      },
      {
        "code": "ХЭМ1.2ж",
        "text": "Цаг агаарын үзэгдлийг таньж нэрлэн,насанд хүрэгчийн сануулгыг дуурайн дагана."
      }
    ],
    "2": [
      {
        "code": "ХЭМ2.1б",
        "text": "Суугаа байрлалд шагайн үеэр эргүүлэх,өлмий ба өсгийг нийлүүлэх, салгах хөдөлгөөнийг гүйцэтгэнэ"
      },
      {
        "code": "ХЭМ2.1в",
        "text": "Гараа ташаанд авч,баруун эсвэл зүүн хөлийг тулалтын хөлийн шагайнд нааж тэнцвэр хадгалан (тогоруу) зогсоно."
      },
      {
        "code": "ХЭМ2.1г",
        "text": "Алхаж, гүйхдээ гар хөлийн хөдөлгөөнөө хослуулан хурдан,удаан гүйцэтгэнэ."
      },
      {
        "code": "ХЭМ2.1д",
        "text": "Сэдэвт алхалт, гүйлтийг хэрэглэл ашиглан гүйцэтгэнэ."
      },
      {
        "code": "ХЭМ2.1е",
        "text": "Саадыг сүлжиж, чиглэлээ өөрчлөн мөлхөнө."
      },
      {
        "code": "ХЭМ2.1ж",
        "text": "Хэвтээ байрлалд хажуу тийш (харандаа) 3 удаа үргэлжлүүлэн өнхөрнө."
      },
      {
        "code": "ХЭМ2.1з",
        "text": "Байрандаа өлмий дээр хөлөө зөөж эргэнэ."
      },
      {
        "code": "ХЭМ2.1и",
        "text": "Хоёр хөл дээр 5 зураас давж үсэрч бууна. (зураас хоорондын зай 35 см)"
      },
      {
        "code": "ХЭМ2.1к",
        "text": "Өргөсөн гараас дээш 5 см өндөр зүйлд үсэрч хүрнэ."
      },
      {
        "code": "ХЭМ2.1л",
        "text": "Өндөрлөг (40 см)зүйл дээр авирч гарна, бууна."
      },
      {
        "code": "ХЭМ2.1м",
        "text": "Бөмбөгийг дээш шиднэ, барьж авна."
      },
      {
        "code": "ХЭМ2.1о",
        "text": "Бөмбөгийг 3 м зайд өшиглөж өнхрүүлнэ."
      },
      {
        "code": "ХЭМ2.2а",
        "text": "Хувийн ариун цэврийг сахих үйлийг насанд хүрэгчийн зааварчилгаагаар хийнэ."
      },
      {
        "code": "ХЭМ2.26.",
        "text": "Цэвэр болон бохирдсон хувцсыг ялгана."
      },
      {
        "code": "ХЭМ2.2в",
        "text": "Жимс,хүнсний ногоог насанд хүрэгчтэй хамтран угааж,хэрэглэнэ."
      },
      {
        "code": "ХЭМ2.2г",
        "text": "Өөрийн хоолны хэрэгслийг хэрэглэнэ,хоолны дараа хураана."
      },
      {
        "code": "ХЭМ2.2д",
        "text": "Өөрийн бие эрхтний онцлог ялгааг мэдэж, бусад хүмүүс хүрч болох,болохгүй хэсгийг ялгаж танина."
      },
      {
        "code": "ХЭМ2.2е",
        "text": "Хүрээлэн байгаа орчныг ажиглаж,аюултай байж болох зүйлсийг ялгаж, хүрэхгүй байна."
      },
      {
        "code": "ХЭМ2.2ж",
        "text": "Цаг агаарын үзэгдлийг ялгаж,насанд хүрэгчийн сануулгыг даган, аюулгүй байдлыг сахих үйлдэл хийнэ."
      }
    ],
    "3": [
      {
        "code": "ХЭМ3.1в",
        "text": "Гарыг дээш өргөн алгаа хавсарч баруун эсвэл зүүн хөлийг тулалтын хөлийн өвдгөнд нааж тэнцвэр хадгалан (дэглий) зогсоно."
      },
      {
        "code": "ХЭМ3.1г",
        "text": "Алхалт гүйлтийг чиглэл,хурдаа өөрчлөн гүйцэтгэнэ."
      },
      {
        "code": "ХЭМ3.1д",
        "text": "Алхалт,гүйлт бүхий хөдөлгөөнт тоглоомыг хамтран тоглоно."
      },
      {
        "code": "ХЭМ3.1е",
        "text": "Мөлхөлтийн төрлүүдийг(бөгсөөрөө гулсах,өвдөг тохойны тусламжтай мөлхөх) хэрэглэл ашиглан гүйцэтгэнэ."
      },
      {
        "code": "ХЭМ3.1ж",
        "text": "Туулай мөлхөлтийн байрлалаас хажуу тийш 1 удаа өнхөрнө."
      },
      {
        "code": "ХЭМ3.1з",
        "text": "Байрандаа хөнгөн үсэрч эргэнэ."
      },
      {
        "code": "ХЭМ3.1и",
        "text": "Хоёр хөл дээр 10 зураас давж үсэрч бууна.(зураас хоорондын зай 60 см)"
      },
      {
        "code": "ХЭМ3.1к",
        "text": "Өргөсөн гараас дээш 10-15 см өндөр зүйлд үсэрч хүрнэ."
      },
      {
        "code": "ХЭМ3.1л",
        "text": "Хананд байрлуулсан шатны 5 гишгүүрт авирч гарна,бууна."
      },
      {
        "code": "ХЭМ3.1м",
        "text": "Бөмбөгийг дээш шидээд газарт ойлгон барьж авна."
      },
      {
        "code": "ХЭМ3.1н",
        "text": "Хурдтай өнхөрч байгаа том бөмбөг,цагариганаас бултаж, зугтана."
      },
      {
        "code": "ХЭМ3.1о",
        "text": "Бөмбөгийг 1,5 м зайнаас өшиглөж,өнхрүүлж, ононо."
      },
      {
        "code": "ХЭМ3.2а",
        "text": "Хувийн ариун цэвэр сахих үйлийг насанд хүрэгчийн сануулгатайгаар бие даан хийнэ."
      },
      {
        "code": "ХЭМ3.26.",
        "text": "Хувцсаа цэвэр өмсөж,бохирдсон тохиолдолд насанд хүрэгчийн сануулгатайгаар солино."
      },
      {
        "code": "ХЭМ3.2в",
        "text": "Хоол,хүнсний бүтээгдэхүүнээс эрүүл мэндэд тустай хүнсийг ялгаж,хэрэглэнэ."
      },
      {
        "code": "ХЭМ3.2г",
        "text": "Хооллох үеийн дүрмийг зохиож,мөрдөнө."
      },
      {
        "code": "ХЭМ3.2д",
        "text": "Өөрийн болон бусдын биеийн хүрч болохгүй хэсгийг ялгаж,шаардлагатай үед “Үгүй” гэж хэлж өөрийгөө хамгаална."
      },
      {
        "code": "ХЭМ3.2е",
        "text": "Хүрээлэн байгаа орчин дахь анхааруулах,болгоомжлох тэмдэг, тэмдэглэгээг таньж, дагаж мөрдөнө."
      },
      {
        "code": "ХЭМ3.2ж",
        "text": "Цаг агаарын үзэгдлийг тайлбарлан,насанд хүрэгчийн сануулгатай болгоомжлох үйлдэл хийнэ."
      },
      {
        "code": "ХЭМ3.2з",
        "text": "Ухаалаг төхөөрөмжийн хэрэглээний эерэг, сөрөг нөлөөг мэдэж,өөрийгөө хамгаалах үйлдэл хийнэ."
      }
    ],
    "4": [
      {
        "code": "ХЭМ4.1в",
        "text": "Гараа алдлан нэг хөлөө арагш шулуун өргөн тэнцвэр хадгалан (хараацай) зогсоно."
      },
      {
        "code": "ХЭМ4.1г",
        "text": "Алхалт, гүйлтийг хөгжмийн хэмнэлд тохируулан чиглэл, хурдаа өөрчилж гүйцэтгэнэ."
      },
      {
        "code": "ХЭМ4.1д",
        "text": "Алхалт,гүйлт бүхий хөдөгөөнт тоглоомыг дүрд орж хамтран тоглоно."
      },
      {
        "code": "ХЭМ4.1е",
        "text": "Мөлхөлтийн төрлүүдийг(туулай мөлхөлт, элгээр гулсаж мөлхөх, нуруугаар гулсаж мөлхөх) хэрэглэл ашиглан гүйцэтгэнэ."
      },
      {
        "code": "ХЭМ4.2ж",
        "text": "Туулай мөлхөлтийн байрлалаас хажуу тийш 2 удаа үргэлжлүүлэн өнхөрнө."
      },
      {
        "code": "ХЭМ4.1з",
        "text": "Байрандаа 1 хөл дээр догонцож эргэнэ."
      },
      {
        "code": "ХЭМ4.1и",
        "text": "Байрнаас уртад харайна."
      },
      {
        "code": "ХЭМ4.1к",
        "text": "30 см өндөртэй тавцан дээрээс үсэрч бууна."
      },
      {
        "code": "ХЭМ4.1л",
        "text": "Хананд байрлуулсан шат болон олсны 10 гишгүүрт авирч гарна; бууна."
      },
      {
        "code": "ХЭМ4.1м",
        "text": "Бөмбөгийг хана руу шиднэ, барьж авна."
      },
      {
        "code": "ХЭМ4.1н",
        "text": "Шидсэн бөмбөгнөөс бултаж, зугтана."
      },
      {
        "code": "ХЭМ4.1о",
        "text": "Саваа модоор бөмбөгийг өнхрүүлж саадыг сүлжинэ."
      },
      {
        "code": "ХЭМ4.2а",
        "text": "Хувийн ариун цэвэр сахих үйлийг өөрийн санаачилгаар бие даан хийнэ."
      },
      {
        "code": "ХЭМ4.26.",
        "text": "Хувцасны цэвэр, бохир байдлыг ялгаж ойлгон, бохирдсон үед өөрийн санаачилгаар цэвэр хувцсаар сольж өмсдөг болно."
      },
      {
        "code": "ХЭМ4.2в",
        "text": "Хүнсний бүтээгдэхүүний төрлийг мэдэж, насанд хүрэгчтэй хамтран хялбар зууш бэлтгэнэ."
      },
      {
        "code": "ХЭМ4.2г",
        "text": "Хоолны хэрэгслийг угааж,цэвэрлэхэд насанд хүрэгчтэй хамтран оролцоно."
      },
      {
        "code": "ХЭМ4.2д",
        "text": "Хувийн аюулгүй байдлаа хамгаалах дүрмийг өдөр тутмын амьдралд дагаж мөрдөнө."
      },
      {
        "code": "ХЭМ4.2е",
        "text": "Хүрээлэн байгаа орчин дахь анхааруулах,болгоомжлох дүрмийг хамтдаа зохиож, өдөр тутам мөрдөнө."
      },
      {
        "code": "ХЭМ4.2ж",
        "text": "Цаг агаарын үзэгдлийг ажиглан өөрийгөө болон бусдыг хамгаалах үйлдэл санаачлан хийнэ."
      },
      {
        "code": "ХЭМ4.2з",
        "text": "Ухаалаг төхөөрөмжийн хэрэглээний эерэг,сөрөг нөлөөг тайлбарлан,зохистой хэрэглэх цаг, дүрмийг мөрдөж, бусдад сануулна."
      }
    ]
  },
  "HEL": {
    "1": [
      {
        "code": "ХЯ1.1б",
        "text": "Хэлсэн авиаг сонсоод давтан хэлнэ."
      },
      {
        "code": "ХЯ1.2а",
        "text": "Харилцан яриаг ажиглан, үг,өгүүлбэрийг дуурайна."
      },
      {
        "code": "ХЯ1.2б",
        "text": "Ярилцахдаа асуулт асуух оролдлого хийнэ."
      },
      {
        "code": "ХЯ1.2в",
        "text": "Танил эд юмсыг нэрлэнэ."
      },
      {
        "code": "ХЯ1.2г",
        "text": "Хүсэл,хэрэгцээгээ тохирох үгс ашиглан илэрхийлнэ."
      },
      {
        "code": "ХЯ1.2д",
        "text": "Энгийн өгүүлбэрийг давтан хэлнэ."
      },
      {
        "code": "ХЯ1.3а",
        "text": "Номыг сонирхож үзнэ."
      },
      {
        "code": "ХЯ1.3б",
        "text": "Зурган тэмдэг тэмдэглэгээг таньж заана."
      },
      {
        "code": "ХЯ1.3в",
        "text": "Харандаа барьж,цаасан дээр мөр гаргана."
      }
    ],
    "2": [
      {
        "code": "ХЯ2.1б",
        "text": "3-4 үгтэй өгүүлбэрийг давтаж хэлнэ."
      },
      {
        "code": "ХЯ2.2а",
        "text": "Энгийн өгүүлбэрээр харилцан ярилцана."
      },
      {
        "code": "ХЯ2.2б",
        "text": "Бусадтай харилцахдаа энгийн, яриатай холбогдсон асуулт асууна."
      },
      {
        "code": "ХЯ2.2в",
        "text": "Юмсын өнгө, хэмжээ,байрлал заасан үгээр ярина."
      },
      {
        "code": "ХЯ2.2г",
        "text": "Үгийн утгыг ойлгож,хураангуй өгүүлбэрээр ярина."
      },
      {
        "code": "ХЯ2.2д",
        "text": "Үйл явдлыг тоочиж ярина."
      },
      {
        "code": "ХЯ2.3а",
        "text": "Номын зургийг ажиглаж,ялган нэрлэнэ."
      },
      {
        "code": "ХЯ2.3б",
        "text": "Орчинд байгаа тэмдэг, тэмдэглэгээг ялгана."
      },
      {
        "code": "ХЯ2.3в",
        "text": "Эрээчиж сараачиж бичнэ."
      }
    ],
    "3": [
      {
        "code": "ХЯ3.1б",
        "text": "Урт,богино авиа орсон үгийг сонсоод ялгаж хэлнэ."
      },
      {
        "code": "ХЯ3.2а",
        "text": "Харилцан ярианд өөрийн санаачилгаар оролцож, санал бодлоо илэрхийлнэ."
      },
      {
        "code": "ХЯ3.2б",
        "text": "Харилцан ярианд сонирхсон зүйлийн тухай асууж, тодруулна."
      },
      {
        "code": "ХЯ3.2в",
        "text": "Юмсын шинж чанар, онцлог илэрхийлсэн үгийг яриандаа ашиглана."
      },
      {
        "code": "ХЯ3.2г",
        "text": "Үгийг оновчтой сонгож,дэлгэрэнгүй өгүүлбэрээр ярина."
      },
      {
        "code": "ХЯ3.2д",
        "text": "Үйл явдлын эхлэл,өрнөл, төгсгөлийг дарааллын дагуу ярина."
      },
      {
        "code": "ХЯ3.3а",
        "text": "Номын зургаас үйл явдлыг ойлгож ярина."
      },
      {
        "code": "ХЯ3.б",
        "text": "Олон нийтийн газар хэрэглэгддэг тэмдэг,тэмдэглэгээг ялгаж нэрлэнэ."
      },
      {
        "code": "ХЯ3.3в",
        "text": "Энгийн зураасыг дагуулж зурна."
      }
    ],
    "4": [
      {
        "code": "ХЯ4.1б",
        "text": "Үгийн эхэнд болон төгсгөлд орсон авиаг сонсоод ялгаж хэлнэ."
      },
      {
        "code": "ХЯ4.2а",
        "text": "Тодорхой сэдвээр санаа бодлоо илэрхийлж, идэвхтэй ярилцана."
      },
      {
        "code": "ХЯ4.2б",
        "text": "Харилцан яриаг асуулт тавьж эхлүүлж,хариултын хүрээнд үргэлжлүүлж ярилцана."
      },
      {
        "code": "ХЯ4.2в",
        "text": "Ерөнхийлсөн нэрийг яриандаа ашиглана."
      },
      {
        "code": "ХЯ4.2г",
        "text": "Үзсэн,оролцсон, болсон үйл явдлыг нийлмэл өгүүлбэрээр ярина."
      },
      {
        "code": "ХЯ4.2д",
        "text": "Үйл явдлыг төсөөлж, зохиож ярина."
      },
      {
        "code": "ХЯ4.3а",
        "text": "Номын агуулга, үйл явдлыг тайлбарлан ярина."
      },
      {
        "code": "ХЯ4.36.",
        "text": "Тэмдэг,тэмдэглэгээний утгыг тайлбарлаж хэрэглэнэ."
      },
      {
        "code": "ХЯ4.3в",
        "text": "Дармал үсгийг дагуулж бичнэ."
      }
    ]
  },
  "BNO": {
    "1": [
      {
        "code": "БНО1.1б",
        "text": "Өдөр тутам хэрэглэдэг жимс, хүнсний ногоог таньж нэрлэнэ."
      },
      {
        "code": "БНО1.1в",
        "text": "Ойр орчны эд зүйлс,тоглоомыг мэдэрч нэрлэнэ."
      },
      {
        "code": "БНО1.1г",
        "text": "Байгалийн үзэгдлийг зааж нэрлэнэ."
      },
      {
        "code": "БНО1.2а",
        "text": "Өөрийн нэр, нас, бие,эрхтнээ нэрлэж,тоглоом, эд зүйлсээ танина."
      },
      {
        "code": "БНО1.2б",
        "text": "Гэр бүлийн гишүүдээ нэрлэж, тэдний хийж буй үйлдлийг дуурайж тоглоно."
      },
      {
        "code": "БНО1.2в",
        "text": "Гэрт болон ангидаа эд зүйлсийн байрлалыг мэдэж,багшийн өгсөн энгийн зааврыг биелүүлнэ."
      },
      {
        "code": "БНО1.2г",
        "text": "Өөрийн хэрэглэсэн эд зүйлс, тоглоомоо байранд нь хурааж,зориулалтын саванд хог хаяхыг оролдоно."
      },
      {
        "code": "БНО1.2д",
        "text": "Үндэсний хувцас(малгай, дээл,гутал)-ыг таньж нэрлэнэ."
      }
    ],
    "2": [
      {
        "code": "БНО2.1б",
        "text": "Тасалгааны ургамлын тоосыг арчих, услах үйлд оролцоно."
      },
      {
        "code": "БНО2.1в",
        "text": "Ойр орчны эд зүйлс,тоглоомын шинжийг мэдэрч, нэрлэн,зориулалтаар нь ашиглана."
      },
      {
        "code": "БНО2.1г",
        "text": "Байгалийн үзэгдлийг ялган таньж, ажиглаж ярилцана."
      },
      {
        "code": "БНО2.2а",
        "text": "Нэр,насаа хэлж,өөрийн болон бусдын эд зүйлс,тоглоомыг ялгана."
      },
      {
        "code": "БНО2.2б",
        "text": "Гэр бүлийн гишүүдийн талаар ярьж,тэдний ажил мэргэжил,хэрэглэдэг хувцас,ажлын багаж хэрэгслийг ялган танина."
      },
      {
        "code": "БНО2.2в",
        "text": "Өөрийн орчны эд зүйлсийг таньж, байршил,зориулалтыг ойлгож, цэцэрлэг,гэр бүлийн орчинд мөрдөх энгийн заавар, дүрмийг дагаж мөрдөнө."
      },
      {
        "code": "БНО2.2г",
        "text": "Өөрийн тоглоом,эд зүйлсээ зориулалтын дагуу хэрэглэж,ус хэмнэх,хогоо ангилж хаяхдаа бусдын тусламжтай хийнэ."
      },
      {
        "code": "БНО2.2д",
        "text": "Үндэсний хувцас,цагаан идээ,тоглоом, наадгайг таньж, баяр ёслолын зарим үйлийг даган дуурайна."
      }
    ],
    "3": [
      {
        "code": "БНО3.1б",
        "text": "Тасалгааны ургамлын гол хэсгүүд (үндэс,иш, навч, цэцэг)-ийг нэрлэж,арчлах,ургуулах үйлд оролцоно."
      },
      {
        "code": "БНО3.1в",
        "text": "Мэдрэхүйн тусламжтайгаар юмсын шинж чанарыг ялгаж харьцуулна."
      },
      {
        "code": "БНО3.1г",
        "text": "Цаг агаарын байдлыг зураг,тэмдэг ашиглан илэрхийлж,тохирсон хувцас болон хийх үйл ажиллагаагаа сонгож тайлбарлана."
      },
      {
        "code": "БНО3.2а",
        "text": "Өөрийн хүйс, төрсөн жилээ хэлж,ангидаа болон гэртээ хийх дуртай зүйлээ тайлбарлана."
      },
      {
        "code": "БНО3.2б",
        "text": "Өөрийн гэр бүлийг танилцуулж, ойр орчны хүмүүсийн ажил мэргэжлийг ялган ойлгож,гэрийн ажилд оролцоно."
      },
      {
        "code": "БНО3.2в",
        "text": "Ойр орчны үйлчилгээний газар (дэлгүүр,эмийн сан,эмнэлэг, номын сан) хүмүүс юу хийдэг, ямар зориулалттайг ялгаж, тухайн газрын дүрмийг баримтална."
      },
      {
        "code": "БНО3.2г",
        "text": "Орчны эд зүйлсийг зориулалтын дагуу ашиглаж,ус хэмнэх, хог хаягдал ялгаж хаях үйлийг бие даан хийнэ."
      },
      {
        "code": "БНО3.2д",
        "text": "Гэр бүлийн орчинд уламжлалт баярыг хэрхэн тэмдэглэдэг талаар өөрийн үгээр тайлбарлаж,ардын тоглоом,наадгайгаар наадна."
      }
    ],
    "4": [
      {
        "code": "БНО4.1б",
        "text": "Ургамлын ургалтад юу хэрэгтэй болохыг тодорхойлж,тарьж ургуулах үйлд оролцоно."
      },
      {
        "code": "БНО4.1в",
        "text": "Ойр орчны эд юмс, тоглоомын материалын шинж чанарыг (төмөр, цаас,шил, даавуу, мод, чулуу) ялгаж, нэрлэнэ."
      },
      {
        "code": "БНО4.1г",
        "text": "Улирлын онцлогоос хамаарч амьтан, ургамал,хүмүүсийн амьдралд гарч буй өөрчлөлтийг тайлбарлаж, өөрийн хийх үйлийг тохируулан сонгоно."
      },
      {
        "code": "БНО4.2а",
        "text": "Өөрийнхөө тухай танилцуулж,бусдын сонирхол,ялгаатай байдалд хүндэтгэлтэй хандана."
      },
      {
        "code": "БНО4.2б",
        "text": "Өөрийн болон бусдын гэр бүлийг хүндэтгэн ойлгож, ажил хөдөлмөрт нь туслан оролцоно."
      },
      {
        "code": "БНО4.2в",
        "text": "Амьдардаг орчныхоо соёл,дурсгалт газрыг нэрлэж, нийтийн орчинд бусдыг хүндэтгэн харилцана."
      },
      {
        "code": "БНО4.2г",
        "text": "Орчны эд зүйлсийг гамтай хэрэглэж, ус бохирдуулахгүй байх,хог хаягдал ангилах үйлд хариуцлагатай хандана."
      },
      {
        "code": "БНО4.2д",
        "text": "Өөрийн үндэсний өв соёлыг бусад үндэстний соёлоос ялган таньж,уламжлалт зан үйл, ёс заншлаар бахархана."
      }
    ]
  },
  "MAT": {
    "1": [
      {
        "code": "МАТ1.3а",
        "text": "Тоглоом юмсаас тодорхой шинжтэй зүйлийг ялгана."
      },
      {
        "code": "МАТ1.3в",
        "text": "Юмсын байршлыг танина. (дээр,доор)"
      }
    ],
    "2": [
      {
        "code": "МАТ2.16.",
        "text": "Дараалан байрлуулсан тоглоом,юмсын зүй тогтлыг ажиглаж,дуурайна."
      },
      {
        "code": "МАТ2.2а",
        "text": "3 хүртэлх тооны тоглоом юмсыг уртаар нь харьцуулна."
      },
      {
        "code": "МАТ2.26.",
        "text": "Өөрийн хийдэг үйлийг өглөө,оройтой холбож нэрлэнэ."
      },
      {
        "code": "МАТ2.3а",
        "text": "Тоглоом юмсыг тодорхой шинжээр хоёр хэсэгт ангилна."
      },
      {
        "code": "МАТ2.36.",
        "text": "Бөмбөг,шоог ялгаж нэрлэнэ."
      },
      {
        "code": "МАТ2.3в",
        "text": "Юмсын байршлыг нэрлэнэ. (дотор,гадна)"
      }
    ],
    "3": [
      {
        "code": "МАТ3.16.",
        "text": "Дараалан байрлуулсан тоглоом,дүрсүүдийн зүй тогтлыг ажиглаж үргэлжлүүлнэ."
      },
      {
        "code": "МАТ3.2а",
        "text": "Тоглоом юмсын урт, хүндийг харьцуулж,тайлбарлана."
      },
      {
        "code": "МАТ3.26.",
        "text": "Өдөр тутмын хийдэг үйлийг дараалуулна."
      },
      {
        "code": "МАТ3.3а",
        "text": "Тоглоом юмсаас нэг шинжээр 4 хүртэлх хэсэгт ангилж,байрлуулна."
      },
      {
        "code": "МАТ3.36.",
        "text": "Дугуй,гурвалжин,дөрвөлжин дүрсүүдийг нэрлэж, дүрс,биетийг ялгана."
      },
      {
        "code": "МАТ3.3в",
        "text": "Чиглэл, байршлын дагуу үйлдэл хийнэ.(өмнө, хойно,дээшээ,доошоо)"
      },
      {
        "code": "МАТ3.4а",
        "text": "Ухаалаг төхөөрөмжийг таньж, хэрэглээ зориулалтаар нь ялгаж нэрлэнэ."
      },
      {
        "code": "МАТ3.46.",
        "text": "Зурган зааварчилгааг ажиглан,дарааллын дагуу дуурайжхийнэ."
      }
    ],
    "4": [
      {
        "code": "МАТ4.16.",
        "text": "Тоглоом,дүрсүүдээр зүй тогтол үүсгэн тайлбарлана.10 хүртэлх тооны дарааллаас орхигдсон тоог тодорхойлно."
      },
      {
        "code": "МАТ4.2а",
        "text": "Юмсын урт,хүнд, багтаамжийг таамаглаад, харьцуулж,тайлбарлана."
      },
      {
        "code": "МАТ4.26.",
        "text": "Долоо хоногийн өдрийг дарааллаар нь нэрлэж,тухайн өдрүүдэд хийдэг танил үйл явдалтай холбож танилцуулна."
      },
      {
        "code": "МАТ4.3а",
        "text": "Тоглоом юмсын ижил ялгаатай шинжийг нэрлэж, ангилж,тайлбарлана."
      },
      {
        "code": "МАТ4.36.",
        "text": "Дүрс, биетийг ялгаж, савх, харандаа зэргийг ашиглан дүрсийг бүтээх, зохиомж хийнэ."
      },
      {
        "code": "МАТ4.3в",
        "text": "Чиглэл,байршлыг ялгаж хэрэглэнэ.(баруун, зүүн,баруун тийш, зүүн тийш"
      },
      {
        "code": "МАТ4.4а",
        "text": "Ухаалаг төхөөрөмжийн дүрс,тэмдэг, тэмдэглэгээг таньж, зориулалтаар хэрэглэж, тайлбарлана."
      },
      {
        "code": "МАТ4.46.",
        "text": "Чиглүүлэг зааврыг дагаж дарааллын дагуу үйлдлийг гүйцэтгэнэ."
      }
    ]
  },
  "ZUR": {
    "1": [
      {
        "code": "ЗУ1.2а",
        "text": "Зурах хэрэгслүүдийг ашиглан зурааслаж дүрсэлнэ."
      },
      {
        "code": "ЗУ1.2б",
        "text": "Бүтээлээ үндсэн өнгөөр бусдын дэмжлэгтэй будна."
      },
      {
        "code": "ЗУ1.2в",
        "text": "Бусдын дэмжлэгтэйгээр толбо, дардсаар зурна."
      },
      {
        "code": "ЗУ1.2г",
        "text": "Баримлын шавраар нэг бүтэцтэй зүйлийг бусдын дэмжлэгтэй барина."
      },
      {
        "code": "ЗУ1.2д",
        "text": "Бэлдэц дүрсээр бусдын дэмжлэгтэй нааж бүтээл урлана."
      },
      {
        "code": "ЗУ1.2е",
        "text": "Өрж байгуулах,эвлүүлэх аргаар тоглоом, эд юмсыг бусдын дэмжлэгтэй бүтээнэ."
      }
    ],
    "2": [
      {
        "code": "ЗУ2.2а",
        "text": "Зураас,дүрсээр өөрийн бодол,төсөөллөө илэрхийлнэ."
      },
      {
        "code": "ЗУ2.2б",
        "text": "Бүтээлээ үндсэн өнгөөр бие дааж будна."
      },
      {
        "code": "ЗУ2.2в",
        "text": "Бие дааж толбо, дардсаар зурна."
      },
      {
        "code": "ЗУ2.2г",
        "text": "Баримлын шавраар хоёр хэсгээс бүтсэн зүйлийг бие дааж барина."
      },
      {
        "code": "ЗУ2.2д",
        "text": "Бэлдэц дүрсээр бие даан нааж бүтээл урлана."
      },
      {
        "code": "ЗУ2.2е",
        "text": "Өрж байгуулах,эвлүүлж угсрах аргаар бие дааж тоглоом, эд юмсыг зохион бүтээнэ."
      }
    ],
    "3": [
      {
        "code": "ЗУ3.2а",
        "text": "Өөрийн бодол төсөөллөөр зохиомжлон зурна."
      },
      {
        "code": "ЗУ3.26.",
        "text": "Өөрийн бүтээлдээ тохирох өнгийг сонгож будна."
      },
      {
        "code": "ЗУ3.2в",
        "text": "Бүтээлээ толбо, дардсаар чимэглэнэ."
      },
      {
        "code": "ЗУ3.2г",
        "text": "Баримлын шавар, элс, гурилан зуурмагаар хүн,амьтан, эд юмсыг зохиомжлон барина.(гурав ба түүнээс дээш хэсгээс бүтсэн)"
      },
      {
        "code": "ЗУ3.2д",
        "text": "Нугалах,эвхэх, хайчлах аргаар хавтгай болон биет наамлын бүтээл урлана."
      },
      {
        "code": "ЗУ3.2е",
        "text": "Тоглоом болон байгалийн материал, дахин ашиглах материалаас сонгож хүрээлэн буй орчноо бүтээнэ."
      }
    ],
    "4": [
      {
        "code": "ЗУ4.2а",
        "text": "Сэдвийн хүрээнд хүрээлэн буй орчин, хүн,амьтан, эд юмсыг зохиомжлон зурна."
      },
      {
        "code": "ЗУ4.2б",
        "text": "Өөрийн бүтээлээ үндсэн болон үүсмэл өнгөөр зохиомжлон будна."
      },
      {
        "code": "ЗУ4.2в",
        "text": "Зураг бүтээлээ хээ угалзаар чимэглэнэ."
      },
      {
        "code": "ЗУ4.2г",
        "text": "Баримлын шаврыг байгалийн материалтай хослуулж сэдэвт баримал барина."
      },
      {
        "code": "ЗУ4.2д",
        "text": "Сэдвийн хүрээнд өөрийн бодол төсөөллөөр наамлын бүтээл урлана."
      },
      {
        "code": "ЗУ4.2е",
        "text": "Тоглоом болон байгалийн материал,дахин ашиглах материалаас сонгож шинэ загвар бүтээнэ."
      }
    ]
  },
  "HUG": {
    "1": [
      {
        "code": "ХӨГ1.1б",
        "text": "Дууг анхааралтай сонсож, зарим үг, авиаг дуурайн хэлж, аялна."
      },
      {
        "code": "ХӨГ1.1в",
        "text": "Дуу,аялгууны хэмнэлд тохируулан хөдөлгөөн хийнэ."
      }
    ],
    "2": [
      {
        "code": "ХӨГ2.1б",
        "text": "Дууны аялгууг дагаж,хамтдаа дуулна."
      },
      {
        "code": "ХӨГ2.1в",
        "text": "Дуу,аялгууны хэмнэлийг мэдэрч хамтран тоглоно."
      },
      {
        "code": "ХӨГ2.1г",
        "text": "Дуу, аялгууг мэдэрч, тохирсон өдөлгөөн хийнэ."
      },
      {
        "code": "ХӨГ2.1д",
        "text": "Үлгэр зохиол, дуу хөгжмийн танил дүрийг дуурайж,харилцан тоглоно."
      }
    ],
    "3": [
      {
        "code": "ХӨГ3.1б",
        "text": "Богино үгтэй дууг бусадтай хамтран дуулна."
      },
      {
        "code": "ХӨГ3.1в",
        "text": "Дуу, аялгууны хэмнэлийг ялгаж, дагаж тоглоно."
      },
      {
        "code": "ХӨГ3.1г",
        "text": "Аялгууны өөрчлөлтийг мэдэрч хөдөлгөөнөөр илэрхийлнэ."
      },
      {
        "code": "ХӨГ3.1д",
        "text": "Үлгэр зохиол,дуу, аялгууны дүрийн онцлогийг илэрхийлж тоглоно."
      }
    ],
    "4": [
      {
        "code": "ХӨГ4.1б",
        "text": "Дуу,аялгууг гарын дохиогоор дуулж,аялна."
      },
      {
        "code": "ХӨГ4.1в",
        "text": "Дуу,аялгууны хэмнэлийг хөгжмийн энгийн зэмсгээр хамтран хөгжимдөнө."
      },
      {
        "code": "ХӨГ4.1г",
        "text": "Хэмнэл,хурд, өнгө аясад тохируулан хөдөлгөөнөө хийнэ."
      },
      {
        "code": "ХӨГ4.1д",
        "text": "Дүрийн зан чанар,харилцааг илэрхийлж хамтран тоглоно."
      }
    ]
  }
};

// Make SUD data available to page scripts that check window.SUD_DATA.
window.DIRECTIONS = DIRECTIONS;
window.SUD_DATA = SUD_DATA;
